# DataFrame_Pandas

## Boolean

In [4]:
print(True == False)
print(True == True)

False
True

In [5]:
True == False

False

In [6]:
True == True

True

In [7]:
True != True

False

In [9]:
True != '1'

True

In [11]:
True == '1'

False

In [24]:
e='Abcde'

In [25]:
big = e.upper()
big

'ABCDE'

In [21]:
print(e.upper())
print(e.lower())

ABCDE
abcde

In [23]:
print(True == False)
print(True != 0)
print(False == 0)
print(True or False)
print(1 == '1')

False
True
True
True
False

In [26]:
eng = 'Korea COVID 19'
eng.lower()

'korea covid 19'

In [28]:
eng.upper()

'KOREA COVID 19'

In [76]:
data = []
data.append('java')
data[0], data[-1], data[1:], data[:2]

('java', 'java', [], ['java'])

In [77]:
data.reverse()
data

['java']

In [78]:
data.sort()
data

['java']

In [37]:
b=(1,2,3,'사','오')
c=1,2,3
type(b),type(c)
b[3] = 4           #튜플의 요소는 기본적으로 바꿀 수 없다.
b[3:], b[1:4]

TypeError: 'tuple' object does not support item assignment

In [43]:
dic = {'name1' : '경민', '학번1' : 20103, 'name2':'경민2','학번2' : 20104}
dic.get('name1')
dic.keys()

dict_keys(['name1', '학번1', 'name2', '학번2'])

In [44]:
dic.values()

dict_values(['경민', 20103, '경민2', 20104])

In [41]:
lunch = {'햄버거', '치킨', '라면', '콜라', 10000}
dinner = {'피자', '족발', '라면', '콜라', 10000}
lunch & dinner

{10000, '라면', '콜라'}

In [42]:
dinner | lunch

{10000, '라면', '족발', '치킨', '콜라', '피자', '햄버거'}

In [45]:
a = [1,2,3]
b=['치킨','피자', '사이다']

In [46]:
a

[1, 2, 3]

In [47]:
b

['치킨', '피자', '사이다']

In [53]:
s1 = [a,b]

In [54]:
s1

[[1, 2, 3], ['치킨', '피자', '사이다']]

In [51]:
import pandas as pd

In [57]:
pd.Series(s1)

0        [1, 2, 3]
1    [치킨, 피자, 사이다]
dtype: object

In [91]:
pd.DataFrame(s1)

   0
0  1
1  2
2  3

In [92]:
pd.DataFrame(data=dict(num=a, menu=b))

   num menu
0    1   치킨
1    2   피자
2    3  사이다

In [99]:
pd.DataFrame(['일','이','삼','사','오'], index=[1,2,3,4,5], columns=['이름'])

  이름
1  일
2  이
3  삼
4  사
5  오

In [81]:
True >= False

True

In [83]:
s1 = pd.core.series.Series([1,2,3])
s2 = pd.core.series.Series(['일','이','삼'])
pd.DataFrame(data=dict(num=s1, word=s2))

   num word
0    1    일
1    2    이
2    3    삼

In [113]:
num_se = pd.Series([1,2,3,4,5])
num_df = pd.DataFrame([1,2,3,4,5], index=[1,2,3,4,5])
num_df

   0
1  1
2  2
3  3
4  4
5  5

In [114]:
num_se

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [119]:
man = [{'name':'은주', 'age':20, 'job':'j1'},{'name':'민서', 'age':30, 'job':'j2'}, {'name':'경민', 'age':15, 'job':'j1'}]
df = pd.DataFrame(man, index=[1,2,3])
df

  name  age job
1   은주   20  j1
2   민서   30  j2
3   경민   15  j1

In [121]:
per = {
    '이름': ['은주','소주','은주','은주'],
    '나이': [30,40,10,21],
    '직업': ['j1','j1','j1','j1']
}
pd.DataFrame(per)

   이름  나이  직업
0  은주  30  j1
1  소주  40  j1
2  은주  10  j1
3  은주  21  j1

In [122]:
person = [['a', 100, 80], ['b', 17, 60], ['b', 50, 40], ['d',90,80]]
col_name=['name', '국어', '영어']
df = pd.DataFrame.from_records(person, columns=col_name, index=[1,2,3,4])
df[['국어','영어']]>70

      국어     영어
1   True   True
2  False  False
3  False  False
4   True   True

In [127]:
maple = {
    '캐릭터' : ['아크','섀도어','소울마스터','루미너스'],
    '레벨' : [210, 0,207,64]
}
pd.DataFrame(maple, index=[1,2,3,4])

     캐릭터   레벨
1     아크  210
2    섀도어    0
3  소울마스터  207
4   루미너스   64